In [1]:
import pandas as pd

In [4]:
customers_df = pd.read_excel('C:\\Users\\STAR\\Downloads\\Data for ETL Assignment.xlsx',sheet_name='Customers')

In [5]:
Products_df = pd.read_excel('C:\\Users\\STAR\\Downloads\\Data for ETL Assignment.xlsx',sheet_name='Products')

In [6]:
Orders_df = pd.read_excel('C:\\Users\\STAR\\Downloads\\Data for ETL Assignment.xlsx',sheet_name='Orders')

In [7]:
Payments_df = pd.read_excel('C:\\Users\\STAR\\Downloads\\Data for ETL Assignment.xlsx',sheet_name='Payments')

In [9]:
customers_df.head()

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374.831.2327x000,2022-11-20 19:15:32
1,2,Mark,Pena,mercedes42@warner.com,001-698-370-1197x3825,2025-02-08 03:18:03
2,3,Amanda,Carney,ricardosimmons@gmail.com,946-520-9112,2022-06-28 09:04:15
3,4,Brandon,Lee,kelleycharles@hotmail.com,915.139.9155x10333,2023-03-06 14:40:08
4,5,Theresa,Ramirez,amybrown@butler.biz,(307)514-8871x86410,2024-08-19 05:20:11

In [44]:
customers_df['phone_number'].unique()

array(['374.831.2327x000', '001-698-370-1197x3825', '946-520-9112',
       '915.139.9155x10333', '(307)514-8871x86410', '+1-421-594-8798',
       '+1-276-218-0867x89262', '001-463-061-5912x78986',
       '(539)142-8091x8797', '+1-934-064-2110x462', '556.589.5451x5831',
       '095.837.9913', '(390)659-9795x87739', '(551)142-2216x33019',
       5172429965, '289-002-5709x0694', '019.426.6713x484',
       '(953)712-6958x27155', '511-997-2755x41172', '795-826-0066x4663',
       '541.799.8722', '(422)557-1760x202', '184-556-2371x1253',
       '628.556.9704x917', '(763)728-3334x54957', '763.597.9534x2265',
       '496.353.2505x9952', '834-449-0222', '192-627-2296x88391',
       '(084)640-3466', '+1-524-361-7547', '+1-335-289-6708x76508',
       '128.021.5236x15225', '259-333-1448x8738', '+1-576-100-8214x558',
       '904.328.8185x798', '001-763-119-5457x72779',
       '+1-592-359-4637x50349', '+1-902-761-3089', '115.579.8539x07775',
       '213.106.8026x68976', '011-551-2736x980', '001-030-722-2002x9945',
       '524-944-2841', '001-010-268-7718x691', 7812369798,
       '001-346-030-0839x1958', '045-551-9274x93255', '+1-989-670-4985',
       3886272665, '(728)180-6959x348', '200-043-9494', 3589704981,
       '697.261.2992', '689.166.6488x926', '(716)049-0731',
       '+1-056-057-7386', '480-340-1808x84978', '+1-383-799-5509x84709',
       '203.466.9417x4777', '001-642-658-9630', '(395)021-2170',
       '001-103-935-9366x783', 7838777572, '+1-785-415-5062x9058',
       '001-854-259-7862x12535', '(179)915-3476x4754', '041.124.5207x173',
       '719-233-9622', '001-534-030-1109x8134', '232-322-3510x760',
       '001-629-480-6549', '+1-376-548-8725x133', '+1-332-380-7494x441',
       '158.057.4906x6646', '(553)109-9477x8894', '950.637.5057x621',
       '001-480-406-9050x0839', '(842)727-5588', '439-829-3760',
       '001-461-685-1080x48876', 4988342375, '+1-435-569-6259',
       '001-205-438-0008x139', '+1-405-154-6716x107',
       '(061)301-2780x04625', '062-756-0129x045', '212.225.6136x808',
       '113-413-9311', '071.943.2610x2666', '+1-407-986-0333x883',
       '(406)192-5207', '611.937.8361x4071', '+1-434-260-4446',
       '001-065-411-3296x274', '149.832.9366x605', '143.924.3829x64356',
       '001-660-204-0662x57909', '(675)384-0611x255',
       '916-323-1800x44661'], dtype=object)

In [53]:
customers_df['phone_number'] = customers_df['phone_number'].str.replace('x','')

In [54]:
customers_df['phone_number'] = customers_df['phone_number'].str.replace('.','-')

In [55]:
customers_df.head()

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374-831-2327000,2022-11-20 19:15:32
1,2,Mark,Pena,mercedes42@warner.com,001-698-370-11973825,2025-02-08 03:18:03
2,3,Amanda,Carney,ricardosimmons@gmail.com,946-520-9112,2022-06-28 09:04:15
3,4,Brandon,Lee,kelleycharles@hotmail.com,915-139-915510333,2023-03-06 14:40:08
4,5,Theresa,Ramirez,amybrown@butler.biz,(307)514-887186410,2024-08-19 05:20:11

In [10]:
Products_df.head()

,product_id,product_name,category,price,stock_quantity,created_at
0,1,Money Wear,Toys,234.12,238,2023-08-23 13:17:46
1,2,Remain Item,Sports,115.50,240,2024-06-17 08:50:24
2,3,True Gadget,Electronics,107.63,90,2025-01-15 02:58:29
3,4,Southern Gadget,Clothing,108.82,239,2022-05-27 14:34:01
4,5,Resource Wear,Clothing,103.66,423,2021-03-05 14:09:38

In [11]:
Orders_df.head()

   order_id  customer_id          order_date  total_amount     status
0         1           82 2024-01-17 19:11:33        163.94  Delivered
1         2           10 2022-05-11 02:09:15        334.71    Shipped
2         3           74 2020-05-20 20:11:19        674.77  Cancelled
3         4           22 2024-08-01 06:28:08        995.61  Delivered
4         5           19 2022-09-01 10:24:57        747.65    Shipped

In [12]:
Payments_df.head()

,payment_id,order_id,payment_method,payment_status,payment_date,amount_paid
0,1,197,PayPal,Completed,2021-08-07 05:44:03,627.38
1,2,173,Bank Transfer,Completed,2022-03-01 11:16:15,46.76
2,3,107,Debit Card,Completed,2024-02-26 18:44:29,586.88
3,4,185,Credit Card,Pending,2022-01-25 22:34:56,293.61
4,5,141,Cash On Delivery,Failed,2024-01-02 15:03:18,377.65

In [13]:
Products_df.isnull().sum()

product_id        0
product_name      0
category          0
price             0
stock_quantity    0
created_at        0
dtype: int64

In [14]:
customers_df.isnull().sum()

customer_id     0
first_name      0
last_name       0
email           0
phone_number    0
created_at      0
dtype: int64

In [15]:
Orders_df.isnull().sum()

order_id        0
customer_id     0
order_date      0
total_amount    0
status          0
dtype: int64

In [16]:
Payments_df.isnull().sum()

payment_id        0
order_id          0
payment_method    0
payment_status    0
payment_date      0
amount_paid       0
dtype: int64

In [17]:
customers_df.duplicated().sum()

0

In [18]:
Orders_df.duplicated().sum()

0

In [19]:
Products_df.duplicated().sum()

0

In [20]:
Payments_df.duplicated().sum()

0

In [22]:
customers_df.columns

Index(['customer_id', 'first_name', 'last_name', 'email', 'phone_number',
       'created_at'],
      dtype='object')

In [24]:
Products_df.columns

Index(['product_id', 'product_name', 'category', 'price', 'stock_quantity',
       'created_at'],
      dtype='object')

In [25]:
Orders_df.columns

Index(['order_id', 'customer_id', 'order_date', 'total_amount', 'status'], dtype='object')

In [26]:
Payments_df.columns

Index(['payment_id', 'order_id', 'payment_method', 'payment_status',
       'payment_date', 'amount_paid'],
      dtype='object')

In [27]:
from sqlalchemy import create_engine

In [31]:
pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Collecting mysql-connector-python
  Downloading mysql_connector_python-9.2.0-cp312-cp312-win_amd64.whl.metadata (6.2 kB)
Downloading mysql_connector_python-9.2.0-cp312-cp312-win_amd64.whl (16.1 MB)
   ---------------------------------------- 0.0/16.1 MB ? eta -:--:--
   --- ------------------------------------ 1.3/16.1 MB 6.7 MB/s eta 0:00:03
   ------ --------------------------------- 2.6/16.1 MB 6.3 MB/s eta 0:00:03
   --------- ------------------------------ 3.9/16.1 MB 6.3 MB/s eta 0:00:02
   ------------- -------------------------- 5.5/16.1 MB 6.5 MB/s eta 0:00:02
   ---------------- ----------------------- 6.8/16.1 MB 6.4 MB/s eta 0:00:02
   -------------------- ------------------- 8.1/16.1 MB 6.5 MB/s eta 0:00:02
   ----------------------- ---------------- 9.4/16.1 MB 6.5 MB/s eta 0:00:02
   --------------------------- ------------ 11.0/16.1 MB 6.5 MB/s eta 0:00:01
   ------------------------------ --------- 12.3/16.1 MB 6.4 MB/s eta 0:00:01
   --------------------------------- ------ 13.6/16.1 MB 6.4 MB/s eta 0:00:01
   ------------------------------------- -- 14.9/16.1 MB 6.4 MB/s eta 0:00:01
   ---------------------------------------- 16.1/16.1 MB 6.3 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.2.0
Note: you may need to restart the kernel to use updated packages.

In [34]:
engine = create_engine('mysql+mysqlconnector://root:5355@localhost:3306/pipeline')

In [56]:
customers_df.to_sql('Customers', con=engine, if_exists='append', index=False)

C:\Users\STAR\AppData\Local\Temp\ipykernel_12148\2092505406.py:1: UserWarning: The provided table name 'Customers' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  customers_df.to_sql('Customers', con=engine, if_exists='append', index=False)

-1

In [40]:
Products_df.to_sql('Products', con=engine, if_exists='append', index=False)

C:\Users\STAR\AppData\Local\Temp\ipykernel_12148\3218749230.py:1: UserWarning: The provided table name 'Products' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Products_df.to_sql('Products', con=engine, if_exists='append', index=False)

-1

In [41]:
Orders_df.to_sql('Orders', con=engine, if_exists='append', index=False)

C:\Users\STAR\AppData\Local\Temp\ipykernel_12148\770235560.py:1: UserWarning: The provided table name 'Orders' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Orders_df.to_sql('Orders', con=engine, if_exists='append', index=False)

-1

In [43]:
Payments_df.to_sql('Payments', con=engine, if_exists='append', index=False)

C:\Users\STAR\AppData\Local\Temp\ipykernel_12148\2416076995.py:1: UserWarning: The provided table name 'Payments' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  Payments_df.to_sql('Payments', con=engine, if_exists='append', index=False)

-1

##### Write an SQL query to find unpaid orders (i.e., orders where no successful payment exists).

In [71]:
query = """ select * from Payments 
          where payment_status <> 'Completed'; """

In [72]:
pd.read_sql( query ,engine)

,payment_id,order_id,payment_method,payment_status,payment_date,amount_paid
0,4,185,Credit Card,Pending,2022-01-25 22:34:56,293.61
1,5,141,Cash On Delivery,Failed,2024-01-02 15:03:18,377.65
2,6,70,Credit Card,Failed,2021-05-01 13:53:06,619.13
3,7,65,Cash On Delivery,Failed,2024-06-05 12:14:55,704.95
4,8,88,Debit Card,Refunded,2023-03-22 14:36:56,972.18
...,...,...,...,...,...,...
145,193,114,PayPal,Refunded,2025-03-03 13:30:53,606.84
146,196,31,Credit Card,Pending,2022-02-16 16:46:29,349.32
147,197,79,PayPal,Refunded,2021-11-13 20:45:17,466.62
148,198,77,Debit Card,Failed,2021-09-05 11:26:14,929.56
149,200,6,Cash On Delivery,Pending,2021-04-29 17:28:55,612.10

##### How can you verify that each Payment record correctly references an existing order_id?

##### Retrieve all customer details.

In [73]:
query = " select * from Customers "

In [74]:
pd.read_sql(query,engine)

,customer_id,first_name,last_name,email,phone_number,created_at
0,1,Regina,Banks,kjones@petty.biz,374-831-2327000,2022-11-20 19:15:32
1,2,Mark,Pena,mercedes42@warner.com,001-698-370-11973825,2025-02-08 03:18:03
2,3,Amanda,Carney,ricardosimmons@gmail.com,946-520-9112,2022-06-28 09:04:15
3,4,Brandon,Lee,kelleycharles@hotmail.com,915-139-915510333,2023-03-06 14:40:08
4,5,Theresa,Ramirez,amybrown@butler.biz,(307)514-887186410,2024-08-19 05:20:11
...,...,...,...,...,...,...
95,96,Brittany,Lopez,ysanchez@duncan.com,149-832-9366605,2021-07-05 15:29:03
96,97,Benjamin,Cantrell,crystal86@wells.com,143-924-382964356,2021-10-08 11:21:26
97,98,Bailey,Jones,carrollcharles@yahoo.com,001-660-204-066257909,2022-12-06 18:54:50
98,99,Adam,Perkins,uluna@smith.net,(675)384-0611255,2020-10-22 06:07:08
99,100,Patrick,Bond,daniel94@smith.net,916-323-180044661,2021-06-01 06:39:22

##### List all orders with their total amount and status

In [82]:
query = 'select order_id,total_amount,status from Orders'

In [83]:
pd.read_sql(query,engine)

     order_id  total_amount     status
0           1        163.94  Delivered
1           2        334.71    Shipped
2           3        674.77  Cancelled
3           4        995.61  Delivered
4           5        747.65    Shipped
..        ...           ...        ...
195       196        773.95    Shipped
196       197        871.39  Cancelled
197       198        712.46    Shipped
198       199        104.72  Delivered
199       200         52.29    Pending

[200 rows x 3 columns]

##### Find all products that belong to the ‘Electronics’ category.

In [87]:
query = """ select * from Products
            where category = 'Electronics'; """

In [88]:
pd.read_sql(query,engine)

,product_id,product_name,category,price,stock_quantity,created_at
0,3,True Gadget,Electronics,107.63,90,2025-01-15 02:58:29
1,8,Shoulder Tool,Electronics,323.72,341,2023-09-24 04:22:21
2,12,Out Accessory,Electronics,69.23,211,2021-06-23 22:53:48
3,24,Break Wear,Electronics,318.88,362,2023-06-11 00:05:28
4,30,Cell Tool,Electronics,32.84,58,2020-03-14 02:40:30
5,34,Myself Device,Electronics,386.33,12,2025-03-04 00:13:55
6,48,Pm Tool,Electronics,15.04,300,2024-10-11 22:53:23
7,57,Away Wear,Electronics,203.06,199,2023-11-02 14:04:23
8,58,Much Gadget,Electronics,449.98,417,2021-09-03 21:40:10
9,60,Job Wear,Electronics,353.33,330,2024-07-17 13:46:36
10,71,Several Tool,Electronics,310.42,138,2021-10-11 13:06:15
11,75,Person Accessory,Electronics,296.70,415,2024-09-25 11:11:58
12,92,Girl Tool,Electronics,69.94,37,2020-04-25 16:31:12
13,99,Address Device,Electronics,315.38,422,2021-05-29 22:26:06

##### Find the total number of orders placed by each customer (customer_id and count).

In [96]:
query = """ select c.customer_id,count(o.order_id) as Total_number_of_Order_Placed
            from Customers c 
            join Orders o 
            on c.customer_id = o.customer_id
            group by 1
            order by 2 desc; """

In [97]:
pd.read_sql(query,engine)

    customer_id  Total_number_of_Order_Placed
0            97                             5
1            12                             5
2            22                             5
3            49                             5
4            32                             5
..          ...                           ...
78           20                             1
79           19                             1
80           51                             1
81           62                             1
82           25                             1

[83 rows x 2 columns]

##### Retrieve a list of all orders, including customer names and order status.

In [103]:
query = """ select concat(c.first_name,' ',c.last_name) as Customer_Name , o.status as Order_Status
            from Customers c 
            join Orders o
            on c.customer_id = o.customer_id
            group by Customer_Name
            order by Customer_Name; """

In [104]:
pd.read_sql(query,engine)

         Customer_Name Order_Status
0    Alexander Wilkins    Cancelled
1        Amanda Carney      Shipped
2          Amanda Diaz      Pending
3       Andrea Jenkins    Delivered
4        Andrew Walker    Cancelled
..                 ...          ...
78       Thomas Steele    Delivered
79  Veronica Maldonado      Shipped
80   Veronica Williams      Shipped
81    Yolanda Crawford      Pending
82       Yolanda Smith      Pending

[83 rows x 2 columns]

##### Find the total revenue (sum of all orders) generated.

In [108]:
query = ' select round(sum(total_amount),2) as Total_Revenue from Orders '

In [109]:
pd.read_sql(query,engine)

   Total_Revenue
0       99055.83

##### Identify customers who have placed more than 3 orders.

In [115]:
query = """ with cte as (select c.customer_id,concat(c.first_name,' ',c.last_name) as Customer_Name , count(o.order_id) as Total_number_of_Order_Placed
            from Customers c 
            join Orders o 
            on c.customer_id = o.customer_id
            group by 1) 
            
            select customer_id,Customer_Name
            from cte 
            where Total_number_of_Order_Placed > 3 ; """

In [116]:
pd.read_sql(query,engine)

    customer_id      Customer_Name
0             3      Amanda Carney
1            10        Carla Young
2            12     Marcia Hoffman
3            13    Sandra Martinez
4            22         Tammy Byrd
5            32         Greg Moran
6            48   Stephanie Chavez
7            49  Veronica Williams
8            54       Latoya Lopez
9            60      Andrew Walker
10           79       Joseph Myers
11           89     Melissa Murray
12           97  Benjamin Cantrell

##### Retrieve all completed payments and include the associated order details.

In [121]:
query = """ select p.payment_status,
            concat(o.order_id,'-',date_format(o.order_date,'%y/%m/%d'),'-',o.total_amount,'-',o.status) as Brif_Order_details
            from Payments p
            join Orders o
            on p.order_id = o.order_id """

In [122]:
pd.read_sql(query,engine)

    payment_status             Brif_Order_details
0        Completed  197-22/08/07-871.39-Cancelled
1        Completed  173-21/09/04-476.13-Delivered
2        Completed  107-20/04/06-595.18-Cancelled
3          Pending   185-20/09/17-31.87-Cancelled
4           Failed    141-23/10/30-236.26-Pending
..             ...                            ...
195        Pending    31-24/06/03-80.87-Cancelled
196       Refunded     79-20/04/30-888.58-Pending
197         Failed     77-24/02/13-549.57-Shipped
198      Completed    190-22/04/16-109.66-Shipped
199        Pending      6-24/08/30-183.19-Pending

[200 rows x 2 columns]

##### Find the top 5 customers who have spent the most on orders.

In [127]:
query = """ select concat(c.first_name,' ',c.last_name) as Customer_Name , round(sum(o.total_amount),2) as Total_Spent
            from customers c
            join Orders o
            on c.customer_id = o.customer_id
            group by 1 
            order by 2 desc
            limit 5; """

In [128]:
pd.read_sql(query,engine)

       Customer_Name  Total_Spent
0     Marcia Hoffman      3335.72
1         Tammy Byrd      3323.19
2  Benjamin Cantrell      3153.06
3        Carla Young      2557.67
4  Veronica Williams      2554.51

##### List all orders where the payment was either ‘Pending’ or ‘Failed’.

In [133]:
query = """ select * from Payments 
            where payment_status = 'Pending' or payment_status = 'Failed' """

In [134]:
pd.read_sql(query,engine)

,payment_id,order_id,payment_method,payment_status,payment_date,amount_paid
0,4,185,Credit Card,Pending,2022-01-25 22:34:56,293.61
1,5,141,Cash On Delivery,Failed,2024-01-02 15:03:18,377.65
2,6,70,Credit Card,Failed,2021-05-01 13:53:06,619.13
3,7,65,Cash On Delivery,Failed,2024-06-05 12:14:55,704.95
4,11,68,Debit Card,Pending,2020-12-02 16:24:34,978.21
...,...,...,...,...,...,...
92,185,93,Cash On Delivery,Failed,2021-11-25 10:22:55,863.92
93,188,170,Bank Transfer,Pending,2022-07-08 15:32:19,817.91
94,196,31,Credit Card,Pending,2022-02-16 16:46:29,349.32
95,198,77,Debit Card,Failed,2021-09-05 11:26:14,929.56
96,200,6,Cash On Delivery,Pending,2021-04-29 17:28:55,612.10

##### Find the most popular product category based on the number of orders.

In [144]:
query = """ select p.category , count(o.order_id) as Total_Sales 
            from Products p
            join Orders o
            on p.product_id = o.product_id
            group by p.category
            order by Total_Sales desc; """

In [145]:
pd.read_sql(query,engine)

         category  Total_Sales
0        Clothing           41
1           Books           36
2     Electronics           35
3          Sports           32
4            Toys           21
5          Beauty           20
6  Home & Kitchen           15

##### Identify orders that were placed but have no successful payment recorded

In [148]:
query = """ select order_id from Payments
            where payment_status <> 'Completed'; """

In [149]:
pd.read_sql(query,engine)

     order_id
0         185
1         141
2          70
3          65
4          88
..        ...
145       114
146        31
147        79
148        77
149         6

[150 rows x 1 columns]

##### Calculate the average order value (AOV) per customer

In [156]:
query = """ select concat(c.first_name,' ',c.last_name) as Customer_Name , round(avg(o.total_amount),2) as Avg_Order_Value
            from Customers c
            join Orders o
            on c.customer_id = o.customer_id
            group by Customer_Name
            order by Avg_Order_Value desc; """

In [157]:
pd.read_sql(query,engine)

     Customer_Name  Avg_Order_Value
0         Mary Lee           993.50
1   Melissa Taylor           888.58
2     Bobby Oliver           876.59
3   Chelsea Flores           854.87
4   Anthony Cooper           847.77
..             ...              ...
78   Thomas Steele           192.42
79   Sherry Warner           167.77
80  Claire Johnson           146.48
81  Glenda Sampson            60.04
82     Keith Huang            35.17

[83 rows x 2 columns]

##### Identify which payment method is most commonly used.

In [161]:
query = """ select payment_method , count(*) as Total_Used 
            from Payments
            group by 1
            order by 2 desc
            limit 1; """

In [162]:
pd.read_sql(query,engine)

     payment_method  Total_Used
0  Cash On Delivery          48

##### Determine the percentage of orders that were canceled.

In [176]:
query = """ SELECT concat(round((SUM(CASE WHEN status = 'Cancelled' THEN 1 ELSE 0 END) / COUNT(*) * 100),2),'%') AS `Cancelled_%`
            FROM Orders; """

In [177]:
pd.read_sql(query,engine)

  Cancelled_%
0      22.00%

##### Find out the month in which the most orders were placed.

In [188]:
query = """ SELECT monthname(order_date) AS 'Month', COUNT(*) AS Number_Of_Orders
            FROM Orders
            GROUP BY monthname(order_date)
            ORDER BY Number_Of_Orders DESC
            LIMIT 1; """

In [189]:
pd.read_sql(query,engine)

     Month  Number_Of_Orders
0  January                22